Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/types.h>
#include <string.h>

#include <esb.h>

#include "usbd_init.h"
#include "ota_hub_relay.hpp"

#if defined(CONFIG_BT)
#include <zephyr/bluetooth/bluetooth.h>
#endif

#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/dfu/mcuboot.h>

#include "BleOtaService.hpp"
#include "IOtaManager.hpp"
#include "OtaManager.hpp"
#include "OtaTargetIdentity.hpp"
#include "ZephyrOtaFlashBackend.hpp"
#endif

LOG_MODULE_REGISTER(helix_mocap_bridge, LOG_LEVEL_INF);

enum {
	HELIX_PACKET_SYNC_ANCHOR = 0xA1,
	HELIX_PACKET_MOCAP_FRAME = 0xC1,
	HELIX_PACKET_OTA_TRIGGER = 0xE1,
};

/* Magic value to prevent accidental OTA triggers. Must match on both sides. */
static constexpr uint32_t kOtaTriggerMagic = 0xDEADBEEFu;

struct __packed HelixSyncAnchor {
	uint8_t type;
	uint8_t central_id;
	uint8_t anchor_sequence;
	uint8_t session_tag;
	uint32_t central_timestamp_us;
};

struct __packed HelixOtaTrigger {
	uint8_t type;           /* HELIX_PACKET_OTA_TRIGGER */
	uint8_t central_id;
	uint8_t target_node_id; /* 0xFF = broadcast */
	uint8_t session_tag;
	uint32_t magic;         /* kOtaTriggerMagic */
};

struct __packed HelixMocapFrame {
	uint8_t type;
	uint8_t node_id;
	uint8_t sequence;
	uint8_t session_tag;
	uint32_t node_local_timestamp_us;
	uint32_t node_synced_timestamp_us;
	int16_t yaw_cdeg;
	int16_t pitch_cdeg;
	int16_t roll_cdeg;
	int16_t x_mm;
	int16_t y_mm;
	int16_t z_mm;
};

struct HelixMocapStatus {
	uint32_t magic;
	uint32_t role;
	uint32_t heartbeat;
	uint32_t phase;
	uint32_t tx_attempts;
	uint32_t tx_success;
	uint32_t tx_failed;
	uint32_t rx_packets;
	uint32_t anchors_sent;
	uint32_t anchors_received;
	uint32_t usb_lines;
	uint32_t tracked_nodes;
	int32_t estimated_offset_us;
	uint32_t last_node_id;
	uint32_t last_sequence;
	uint32_t last_rx_len;
	uint32_t last_error;
};

struct NodeTrack {
	uint8_t node_id;
	bool active;
	uint32_t packets;
	uint32_t gaps;
	uint8_t last_sequence;
	uint32_t last_node_timestamp_us;
	uint32_t last_synced_timestamp_us;
	uint32_t last_rx_timestamp_us;
};

volatile struct HelixMocapStatus g_helixMocapStatus;

static const struct gpio_dt_spec led = GPIO_DT_SPEC_GET_OR(DT_ALIAS(led0), gpios, {0});
static const struct device *const host_stream = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
static struct esb_payload rx_payload;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static struct esb_payload tx_payload;
static atomic_t tx_ready = ATOMIC_INIT(1);
static bool have_anchor;
static int32_t estimated_offset_us;
/* Set from ESB ISR when an OTA trigger arrives; main loop reboots. */
static atomic_t ota_reboot_pending = ATOMIC_INIT(0);
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack tracked_nodes[CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES];
static uint8_t next_anchor_sequence;
/* When non-zero, the central injects an OTA trigger into the next ACK
 * payload for the target node (0xFF = broadcast). Cleared after send. */
static volatile uint8_t ota_trigger_target_node;
static volatile uint8_t ota_trigger_retries;
static volatile uint32_t ota_triggers_sent;

/* Request an OTA trigger for a specific node (or 0xFF = broadcast).
 * Sends the trigger on the next few FRAMEs from the target, then clears.
 * Called from the Hub relay when the PC requests a remote OTA trigger. */
extern "C" void helix_request_ota_trigger(uint8_t node_id, uint8_t retries)
{
	ota_trigger_retries = retries;
	ota_trigger_target_node = node_id;
}
#endif

static uint32_t now_us(void)
{
	return (uint32_t)(k_uptime_get() * 1000LL);
}

static void status_set_error(int err)
{
	g_helixMocapStatus.last_error = (uint32_t)(err < 0 ? -err : err);
}

static int clocks_start(void)
{
	int err;
	int res;
	struct onoff_manager *clk_mgr;
	struct onoff_client clk_cli;

	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (clk_mgr == NULL) {
		return -ENXIO;
	}

	sys_notify_init_spinwait(&clk_cli.notify);
	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		return err;
	}

	do {
		err = sys_notify_fetch_result(&clk_cli.notify, &res);
		if (!err && res) {
			return res;
		}
	} while (err);

	return 0;
}

static void led_set(bool on)
{
	if (!gpio_is_ready_dt(&led)) {
		return;
	}

	(void)gpio_pin_set_dt(&led, on ? 1 : 0);
}

static void heartbeat_tick(void)
{
	static bool on;

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && defined(CONFIG_HELIX_MOCAP_NODE_LED_DEBUG)
	uint32_t period_ms = 125U;

	if (have_anchor) {
		period_ms = 500U;
	} else if (g_helixMocapStatus.tx_success > 0U) {
		period_ms = 250U;
	}

	led_set(((now_us() / 1000U) / period_ms) & 1U);
#else
	on = !on;
	led_set(on);
#endif
	g_helixMocapStatus.heartbeat++;
}

static void host_write(const char *line)
{
	if (!device_is_ready(host_stream)) {
		return;
	}

	for (const char *p = line; *p != '\0'; ++p) {
		uart_poll_out(host_stream, (unsigned char)*p);
	}
}

static void report_summary(void)
{
	char line[192];

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=central rx=%u anchors=%u tracked=%u usb_lines=%u err=%u hb=%u trigs=%u\n",
		 g_helixMocapStatus.rx_packets,
		 g_helixMocapStatus.anchors_sent,
		 g_helixMocapStatus.tracked_nodes,
		 g_helixMocapStatus.usb_lines,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat,
		 ota_triggers_sent);
#else
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=node id=%u tx_ok=%u tx_fail=%u anchors=%u offset_us=%d err=%u hb=%u\n",
		 CONFIG_HELIX_MOCAP_NODE_ID,
		 g_helixMocapStatus.tx_success,
		 g_helixMocapStatus.tx_failed,
		 g_helixMocapStatus.anchors_received,
		 g_helixMocapStatus.estimated_offset_us,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat);
#endif

